src/Автолавки/src/Documents/ПланЗакупок/ПланЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланЗакупок</name>
  <basedOn>Document.РеализацияТоваровАвтолавкой</basedOn>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусПланаЗакупок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Автолавки/src/Enums/СтатусПланаЗакупок/СтатусПланаЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусПланаЗакупок</name>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

src/Автолавки/src/Documents/ПланЗакупок/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровАвтолавкой") Тогда
		Для Каждого ТекСтрокаСписокТоваров Из ДанныеЗаполнения.СписокТоваров Цикл
			НоваяСтрока = СписокТоваров.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокТоваров.Количество;
			НоваяСтрока.Товар = ТекСтрокаСписокТоваров.Товар;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Статус = Перечисления.СтатусПланаЗакупок.Отклонен Тогда
		Сообщить("Нельзя провести план со статусом " + Статус);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
